// pages/food/food.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    addFav: 'addFav',
    btnFav: '收藏',
    btnClass: 'btn',
    food: [],
    foodList: [
      {
        title: '营养早餐',
        imgSrc: '/imgs/food1.jpg',
        txt: '大米，玉米粒，胡萝卜，香菇，火腿',
        practice: '1、把大米洗净泡1个小时以上，胡萝卜洗净切成小粒，玉米粒我用的是罐头的，香菇、火腿也切成小粒。\n2、将大米中放些色拉油，同时放入香菇粒然后开始煮。\n3、开锅后，放入胡萝卜、玉米粒，边煮边搅拌，要按一个方向哦！\n4、感觉快熬好的时候（大概20分钟），放入火腿丁，再次开锅后，撒入葱花，最好用盐调味即可。'
      },
      {
        title: '嫩滑蒸水蛋',
        imgSrc: '/imgs/food2.jpg',
        txt: '鸡蛋：3个、温水：300ml、盐：1-2g、油：适量、酱油：适量、葱花：适量',
        practice: '1、将鸡蛋打入碗中，加入油和盐\n2、用手动打蛋器或筷子顺着同一个方向充分打散\n3、加入温水，搅拌均匀\n4、打好的蛋液用筛子过滤一遍或直接除去浮沫倒入陶瓷或玻璃浅盘，除去浮沫，如果有筛子的最好过滤一遍，就很容易去除泡沫和杂质了，这样成品水蛋会更细腻完美\n5、水箱装满水，选择【预热】功能，蒸汽模式100度预热\n6、水蛋放入自上而下第三层，选择【蒸汽】模式100度/21分钟，具体时间根据蛋液的厚度、蛋液的量来调整。\n7、时间到了之后不要立刻拿出来哦，在法帅蒸汽烤箱中焖个2分钟，利用余温让其蒸出来受热更均匀~最后撒上葱花和淋上酱油就可以开餐啦'
      },
      {
        title: '花生酱西士多',
        imgSrc: '/imgs/food3.jpg',
        txt: '甜吐司2片、鸡蛋1个、去皮干花生20g、糖适量、盐适量',
        practice: '1、花生食用油热好冷却备用；把花生粒，适量糖、适量盐放入破壁机研磨杯中，选择【研磨】功能启动；\n2、把研磨好的花生泥倒出；\n3把已经热好冷却好的花生油倒入花生泥中，搅拌均匀；\n4、吐司切去四条边；\n5、取一片吐司抹上适量的花生酱，盖上另一片吐司；\n6、将吐司放进装有蛋液的碗里双面蘸上蛋液，轻轻蘸满即可；\n7、平底锅倒入油烧热，放入吐司片用小火煎；\n8、煎至两面金黄色，取出用纸巾吸一下多余的油即可；'
      },
      {
        title: '苦荞红豆包',
        imgSrc: '/imgs/food4.jpg',
        txt: '雁门清高有机纯苦荞粉60克、面粉150克、红豆馅200克、干酵母粉4克',
        practice: '1、将苦荞粉、面粉按照1:4的比例，加入干酵母粉混合，倒入温水，用筷子搅拌成絮状；\n2、用手揉面，揉至面团表面光滑，面团放到容器中包上保鲜膜，放在温暖处发酵至2倍大；\n3、发酵好后，将面团放在案板上，再反复揉一会，将揉好的面团分成50克1份，红豆馅分成35克1份，滚成球状；\n4、面团压成圆饼，包入红豆馅，再将收口收紧，团成圆形；\n5、做好的豆包坯放入锅中，表面盖上湿布，继续发酵20－30分钟，使生坯涨大，发至轻轻按压表皮，有弹性即可；\n6、大火烧开蒸锅内的水，转中火蒸约15分钟即可，关火后焖约3分钟后再开盖；\n7、春天再困也要好好吃早餐，不要赖床哦，苦荞红豆包都给你做好了，香到跳脚的苦荞红豆包就完成啦！'
      },
      {
        title: '家常小炒',
        imgSrc: '/imgs/food5.jpg',
        txt: '猪肉一小块、木耳两朵、豆干3~4块、红萝卜一小块、金针菇1包、葱1根、酱油1大匙、米酒少许、醋少许、香油少许',
        practice: '1、先将所有食材切丝 , 肉丝用酱油先抓醃一下 , 葱白葱绿分开\n2、先炒红萝卜丝 , 将茄红素炒出来后 , 再放入豆干炒出豆干的香气\n3、2步骤好了之后先下肉丝拌炒几下 , 把肉丝炒开 , 就将木耳 . 金针菇 . 葱白也一起下锅 , 炒稍微软后加酱油 . 米酒呛锅 , 可以加少许的水煨一下 , 起锅前加入葱绿少许的醋跟香油'
      },
      {
        title: '小炒咖喱牛肉土豆',
        imgSrc: '/imgs/food6.jpg',
        txt: '主料：牛肉100克，长土豆1个，洋葱1/2个。\n辅料：蒜茸1小匙，姜茸1小匙，辣椒屑1小匙，红椒1只。\n腌肉调料：玉米淀粉1小匙，生抽1大匙，白糖1/4小匙，胡椒粉1/3小匙，苏打粉1/4小匙，料酒1大匙，菜油1大匙。\n上锅调料：咖喱块约8克，生抽1大匙，精盐1/4小匙，白糖1/2大匙，胡椒粉1/3小匙，玉米淀粉1小匙、麻油1/2小匙。-2g、油：适量、酱油：适量、葱花：适量',
        practice: '一、牛肉切薄片入一碗，加玉米淀粉1小匙，抓匀，再加生抽1大匙，白糖1/4小匙，胡椒粉1/3小匙，苏打粉1/4小匙，料酒1大匙，抓至手感粘手，如果太干，可加1大匙水抓至水被吸收，最后加菜油1大匙，抓匀以锁住水分，腌肉工作基本完成后盖盖子不让水分跑掉，静置1小匙，入冰箱隔夜更入味；\n二、土豆切薄片，用水冲去淀粉后容器加清水和，加白醋2大匙，搅拌均匀，浸泡土豆2分钟，然后再冲洗；\n三、准备好姜茸和蒜茸，洋葱切片，把2块洋葱剁碎，辣椒切块，咖喱稍切碎，准备好用玉米淀粉加清水1/4杯的淀粉水；\n四、滑炒牛肉至断生，盛起备用；\n五、起锅升大中火，锅热放底油，放姜茸、蒜茸和洋葱碎及辣椒屑，稍爆，再加入咖喱，爆香；\n六、加入土豆片，爆炒片刻；\n七、放辣椒块和洋葱，放调料生抽1大匙，精盐1/4小匙，白糖1/2大匙，胡椒粉1/3小匙，翻炒均匀；\n八、倒入牛肉兜几下，加淀粉水勾薄芡，熄火，撒麻油1/2小匙，翻几下即出锅。'
      },
      {
        title: '小炒牛肉',
        imgSrc: '/imgs/food7.jpg',
        txt: '里脊牛肉250克、二青椒8根、小米椒3根、3个独蒜、郫县豆瓣、老抽、花椒、料酒、嫩肉粉、五香粉、盐、味精',
        practice: '1、牛肉洗净、切薄片、加五香粉、料酒、嫩肉粉、拌均。蒜切颗粒，青椒和小米椒切1厘米段。\n2、油锅烧热，放牛肉炒散，没有血水时，把牛肉铲起来放在盘子里，剩余的油烧热，放豆瓣蒜粒、花椒、少许老抽炒香后，又把牛肉倒下去和炒，炒个几十秒就可以了，放盐和味精即可。'
      },
      {
        title: '小炒肉',
        imgSrc: '/imgs/food8.jpg',
        txt: '五花肉 1块（约300g），杭椒 200g，洋葱 1个（约100g），朝天椒 3只，蒜 2瓣，绍酒 1汤匙（15ml），生抽 4茶匙（20ml），白砂糖 1茶匙（5g），盐 1茶匙（5g），油 1汤匙（15ml）',
        practice: '1、将五花肉平整地放入冰箱中冷冻约20分钟，待五花肉僵硬后再取出切成6cm长、3cm宽、尽可能薄的片。\n2、洋葱对半剖开，切去根部和顶端，再切成细丝。蒜切薄片。杭椒和朝天椒洗净对半剖开待用。\n3、中火烧热平底煎锅中的油，待烧至五成热时（将手掌置于平底煎锅上端，能感到有热气升腾），将五花肉一片一片地放入锅中，使肉片双面煎至稍稍上色，肥脂呈透明色，再夹出沥干油分待用。\n4、中火烧热平底煎锅中的底油，待烧至五成热时将洋葱丝、朝天椒和蒜片放入锅中爆香，再放入杭椒，炒至变软熟透（约3分钟）。\n5、将煎好的五花肉片放入平底煎锅中翻炒片刻。\n6、最后在锅中调入绍酒、生抽、白砂糖和盐拌炒约2分钟即可。'
      }
    ]
  },
  addFav() {
    let food = this.data.food
    let arr = []
    wx.getStorage({
      key: 'favList',
      success(res) {
        let resList = res.data
        let foodToo = resList.find((item) => {
          return item.title == food.title
        })
        if(foodToo == res.data.title) {
          arr = res.data
          arr.push(food)
          wx.setStorage({
            key: 'favList',
            data: arr
          })
          wx.showToast({
            title: '已添加到收藏夹',
            icon: 'success',
            duration: 1500
          })
        }
        else {
          wx.showToast({
            title: '已收藏过',
            icon: 'none',
            duration: 1500
          })
        }
      },
      fail() {
        arr.push(food)
        wx.setStorage({
          key: 'favList',
          data: arr
        })
        wx.showToast({
          title: '已添加到收藏夹',
          icon: 'success',
          duration: 1500
        })
      }
    })
  },
  go() {
    wx.switchTab({
      url: '/pages/favorites/favorites',
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    let foodname = this.data.foodList.find((item) => {
      return item.title == options.foodtitle
    })
    this.setData({
      food: foodname
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    let food = this.data.food
    let that = this
    wx.getStorage({
      key: 'favList',
      success(res) {
        let resList = res.data
        let foodToo = resList.find((item) => {
          return item.title == food.title
        })
        if(foodToo == res.data.title) {
          that.setData({
            addFav: 'addFav',
            btnFav: '收藏',
            active: ''
        })
        }
        else {
          that.setData({
            addFav: 'go',
            btnFav: '进入收藏夹',
            active: 'active'
          })
        }
      },
      fail() {
      }
    })
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})